app/views/teams/show.html.erb

SELECT "categories".* FROM "categories" WHERE "categories"."team_id" = ?  [["team_id", 1]]
---

  <% @team.categories.each do |category| %>