app/views/users/index.html.erb

        </div>
        <span class="user-post-count"><%= "#{user.posts.count} 投稿" %></span>
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]