app/views/users/show.html.erb

        <div class="d-flex gap-2 post-actions">
          <span class="posts-meta"><%= "#{post.comments.count} コメント" %></span>
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 49]]