app/views/posts/index.html.erb

      </div>
      <p class="caption"><%= "#{post.comments.count} コメント" %></p>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 35]]