app/views/posts/show.html.erb

          <%= link_to team_category_post_favorites_path(@team, @category, @post), data: { turbo_method: :delete }, class: "favorite_btn" do %>
            ♥<%= @post.favorites.count %>お気に入り済
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."post_id" = ?  [["post_id", 35]]

          <%= link_to team_category_post_favorites_path(@team, @category, @post), data: { turbo_method: :post }, class: "favorite_btn" do %>
            ♡<%= @post.favorites.count %>お気に入り
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."post_id" = ?  [["post_id", 35]]

      <h1 class="p-h1 pd-h">コメント</h1>
      <p class="c-count">コメント <%= @post.comments.count %>件</p>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 35]]