app/controllers/categories_controller.rb

  def create
    @category = @team.categories.build(category_params)
    if @category.save
---
INSERT INTO "categories" ("name", "team_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "新年会について"], ["team_id", 1], ["created_at", "2026-01-19 14:19:51.284632"], ["updated_at", "2026-01-19 14:19:51.284632"]]

  def index
    @categories = @team.categories.page(params[:page]).reverse_order
    @categories = @categories.where('name LIKE ?', "%#{params[:search]}%") if params[:search].present?
---
SELECT "categories".* FROM "categories" WHERE "categories"."team_id" = ? ORDER BY "categories"."id" DESC LIMIT ? OFFSET ?  [["team_id", 1], ["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "categories" WHERE "categories"."team_id" = ?  [["team_id", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."team_id" = ? AND "categories"."id" = ? LIMIT ?  [["team_id", 1], ["id", 2], ["LIMIT", 1]]

  def show
    @posts = @category.posts.published.page(params[:page]).reverse_order
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."category_id" = ?  [["category_id", 8]]
SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = ?  [["category_id", 10]]

  def destroy
    if @category.destroy
---
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 7]]

  def set_team
    @team = Team.find(params[:team_id])
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def set_category
    @category = @team.categories.find_by(id: params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."team_id" = ? AND "categories"."id" = ? LIMIT ?  [["team_id", 1], ["id", 9], ["LIMIT", 1]]