app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."team_id" = ? AND "categories"."id" = ? LIMIT ?  [["team_id", 1], ["id", 2], ["LIMIT", 1]]
---
  def update
    @category = @team.categories.find(params[:id])

SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_team
    @team = Team.find(params[:team_id])