app/controllers/comments_controller.rb

SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."team_id" = ? AND "categories"."id" = ? LIMIT ?  [["team_id", 15], ["id", 20], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = ? AND "posts"."id" = ? LIMIT ?  [["category_id", 20], ["id", 36], ["LIMIT", 1]]
INSERT INTO "comments" ("comment", "user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["comment", "１"], ["user_id", 1], ["post_id", 36], ["created_at", "2026-01-20 10:02:19.100440"], ["updated_at", "2026-01-20 10:02:19.100440"]]
---
    def create
        @team = Team.find(params[:team_id])
        @category = @team.categories.find(params[:category_id])
        @post = @category.posts.find(params[:post_id])
        @comment = @post.comments.build(comment_params)
        @comment.user_id = current_user.id
        if @comment.save