app/controllers/favorites_controller.rb

  def create
    post = Post.find(params[:post_id])
    favorite = post.favorites.find_or_initialize_by(user: current_user)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 35], ["LIMIT", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."post_id" = ? AND "favorites"."user_id" = ? LIMIT ?  [["post_id", 35], ["user_id", 1], ["LIMIT", 1]]

  def destroy
    post = Post.find(params[:post_id])
    favorite = post.favorites.find_by(user: current_user)
    favorite&.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 35], ["LIMIT", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."post_id" = ? AND "favorites"."user_id" = ? LIMIT ?  [["post_id", 35], ["user_id", 1], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]