app/controllers/posts_controller.rb

  def create
    @post = @category.posts.build(post_params)
    @post.team_id = @team.id
    @post.user = current_user
    if @post.save
---
INSERT INTO "posts" ("user_id", "team_id", "category_id", "title", "post", "image_id", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def index
    @posts = @category.posts.page(params[:page]).reverse_order
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."category_id" = ?  [["category_id", 8]]
SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = ? AND "posts"."id" = ? LIMIT ?  [["category_id", 3], ["id", 3], ["LIMIT", 1]]

  def show
    @comment = Comment.new
    @comments = @post.comments.page(params[:page]).per(7).reverse_order
---
SELECT COUNT(*) FROM (SELECT 1 AS one FROM "comments" WHERE "comments"."post_id" = ? ORDER BY "comments"."id" DESC LIMIT ? OFFSET ?) subquery_for_count  [["post_id", 32], ["LIMIT", 7], ["OFFSET", 0]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 37]]

  def update
    @post.user ||= current_user
    if @post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "333"], ["updated_at", "2026-01-20 13:55:45.345656"], ["id", 40]]

  def set_team
    @team = Team.find(params[:team_id])
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def set_category
    @category = @team.categories.find(params[:category_id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."team_id" = ? AND "categories"."id" = ? LIMIT ?  [["team_id", 2], ["id", 3], ["LIMIT", 1]]

  def set_post
    @post = @category.posts.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = ? AND "posts"."id" = ? LIMIT ?  [["category_id", 6], ["id", 6], ["LIMIT", 1]]