app/controllers/posts_controller.rb

SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_team
    @team = Team.find(params[:team_id])

SELECT "categories".* FROM "categories" WHERE "categories"."team_id" = ? AND "categories"."id" = ? LIMIT ?  [["team_id", 2], ["id", 3], ["LIMIT", 1]]
---
  def set_category
    @category = @team.categories.find(params[:category_id])