app/controllers/teams_controller.rb

INSERT INTO "teams" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "〇〇係"], ["created_at", "2026-01-20 03:02:31.919157"], ["updated_at", "2026-01-20 03:02:31.919157"]]
---
  def create
    @team = Team.new(team_params)
    if @team.save

SELECT "teams".* FROM "teams" ORDER BY "teams"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "teams"
---
  def index
    @teams = Team.page(params[:page]).reverse_order

SELECT "categories".* FROM "categories" WHERE "categories"."team_id" = ? ORDER BY "categories"."id" DESC LIMIT ? OFFSET ?  [["team_id", 14], ["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "categories" WHERE "categories"."team_id" = ?  [["team_id", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."team_id" = ?  [["team_id", 8]]
---
  def show
    @categories = @team.categories.page(params[:page]).reverse_order
    @categories = @categories.where('name LIKE ?', "%#{params[:search]}%") if params[:search].present?

UPDATE "teams" SET "name" = ?, "updated_at" = ? WHERE "teams"."id" = ?  [["name", "11係"], ["updated_at", "2026-01-14 12:33:51.288416"], ["id", 1]]
---
  def update
    if @team.update(team_params)

DELETE FROM "teams" WHERE "teams"."id" = ?  [["id", 8]]
---
  def destroy
    if @team.destroy