app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @team = Team.find(params[:id])

SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
    @team = Team.find(params[:id])

SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def destroy
    @team = Team.find(params[:id])