app/views/categories/show.html.erb

      <p class="caption"><%= post.user.name %></p>
      <p class="caption"><%= "#{post.comments.count} コメント" %></p>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 49]]