app/views/categories/show.html.erb

<h2>投稿一覧</h2>
<% if @category.posts.any? %>
  <% @category.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = ?  [["category_id", 2]]
SELECT 1 AS one FROM "posts" WHERE "posts"."category_id" = ? LIMIT ?  [["category_id", 5], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = ?  [["category_id", 6]]